aaron-bond.better-comments
charliermarsh.ruff
christian-kohler.path-intellisense
dbaeumer.vscode-eslint
detachhead.basedpyright
docker.docker
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mhutchie.git-graph
miguelsolorio.fluent-icons
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vsliveshare.vsliveshare
openai.chatgpt
pkief.material-icon-theme
robbowen.synthwave-vscode
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
vscodevim.vim
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
